tg-bot/ШаблонБота/src/Documents/РеализацияМерча/РеализацияМерча.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияМерча</name>
  <registerRecords>AccumulationRegister.ОстаткиМерча</registerRecords>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.НоменклатураМерча</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерений</name>
      <type>
        <types>EnumRef.ТипВознаграждения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

tg-bot/ШаблонБота/src/AccumulationRegisters/ОстаткиМерча/ОстаткиМерча.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиМерча</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.НоменклатураМерча</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

tg-bot/ШаблонБота/src/Enums/ТипВознаграждения/ТипВознаграждения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипВознаграждения</name>
  <enumValues>
    <name>Золото</name>
  </enumValues>
  <enumValues>
    <name>Серебро</name>
  </enumValues>
</mdclass:Enum>

tg-bot/ШаблонБота/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>КоличествоЗолото</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСеребро</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

tg-bot/ШаблонБота/src/Documents/РеализацияМерча/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОстаткиМерча.Записывать = Истина;
	
	ТЗ = Товары.Выгрузить();
	ТЗ.Свернуть("Номенклатура", "Количество");
	
	Для Каждого ТекСтрокаТовары Из ТЗ Цикл
		Движение = Движения.ОстаткиМерча.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	Движения.Записать();
	//проверка на наличие товара
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиМерчаОстатки.Номенклатура КАК Номенклатура,
	               |	ОстаткиМерчаОстатки.КоличествоОстаток КАК КоличествоОстаток
	               |ИЗ
	               |	РегистрНакопления.ОстаткиМерча.Остатки(&МоментВремени, ) КАК ОстаткиМерчаОстатки
	               |ГДЕ
	               |	ОстаткиМерчаОстатки.КоличествоОстаток < 0";
	
	Граница = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", Граница);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;

	СуммаЗолото = 0;
	СуммаСеребро = 0;
	Для Каждого Строка Из Товары Цикл
		Если Строка.ЕдиницаИзмерений = Перечисления.ТипВознаграждения.Золото Тогда
			СуммаЗолото = СуммаЗолото + (Строка.Цена * Строка.Количество);
		Иначе 
			СуммаСеребро = СуммаСеребро + (Строка.Цена * Строка.Количество); 
		КонецЕсли;
	КонецЦикла;
	
	//проверка на наличие монет 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ФизическиеЛица.КоличествоЗолото КАК КоличествоЗолото,
	               |	ФизическиеЛица.КоличествоСеребро КАК КоличествоСеребро
	               |ИЗ
	               |	Документ.РеализацияМерча КАК РеализацияМерча
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |		ПО РеализацияМерча.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |ГДЕ
	               |	РеализацияМерча.ФизическоеЛицо = &ФизическоеЛицо";
	Запрос.УстановитьПараметр("ФизическоеЛицо", ФизическоеЛицо);
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗолотоЛицо = Выборка.КоличествоЗолото;
		СереброЛицо = Выборка.КоличествоСеребро;
	КонецЦикла;
	
	Если СуммаЗолото > ЗолотоЛицо ИЛИ СуммаСеребро > СереброЛицо Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//списание монет
	
	СсылкаСправочник = Справочники.ФизическиеЛица.НайтиПоНаименованию(ФизическоеЛицо);
	СправочникОбъект = СсылкаСправочник.ПолучитьОбъект();
	СправочникОбъект.КоличествоЗолото = ЗолотоЛицо - СуммаЗолото;
	СправочникОбъект.КоличествоСеребро = СереброЛицо - СуммаСеребро;
	СправочникОбъект.Записать();
	КонецПроцедуры
